# CurveSupportOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveSupportOffset Property
ParameterTypeId Class See Also
---
"Wall offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveSupportOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveSupportOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveSupportOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace